[{"name":"China Wok","business_types":"Chinese","phone":"(631) 758-7238","website":"","from_the_business":"","hours":"","specialties":null,"history":null,"business_owner":null,"meet_the_business_owner":null,"overall_rating":4.0,"takeout":true,"delivery":true,"accepts_credit_cards":true,"accepts_apple_pay":false,"parking":null,"bike_parking":true,"wheelchair_accessible":false,"location":{"address":"157 Long Island Ave","city":"Holtsville","state":"NY","zip":"11742","cross_streets":"","neighborhoods":""},"yelp_website":"http://www.yelp.com/biz/china-wok-holtsville","reviews":[{"author":"Sean D.","rating":5.0,"content":"Awesome chinese food!! The rice is delicious,the sesame chicken is amazing, and they have some amazing dumplings. Friendly staff, definitely will order again!!"},{"author":"Christina J.","rating":4.0,"content":"Wanted quick dinner \u0026 I pass this place on my way to my little brothers place. It's a tiny takeout spot. Every time I pass there are people coming \u0026 going. That's a good sign. Quick turnover. So tonight I stop in \u0026 circle my order on the menu. Roast Pork Egg Foo Young \u0026 BBQ Spareribs. I can only judge by my old stand bys. RPEFY 2 nice sized egg party's with ample gravy. The gravy was ok. Not great. The Spareribs were delicious. Large \u0026 Meaty with a great flavor. Will definitely be back for the ribs. Will update when I've tried more items. 4-1-2016"},{"author":"L P.","rating":2.0,"content":"Was a bit disappointed , really really wanted this place to be good :( hot \u0026 sour soup , ugh, yuck! ( I had leftovers and my son dropped and cracked the container. It was all jelly-fied ( is that a word) SO into the garbage ).... Wonton soup, just ok. Steamed dumplings, dough too too thick and well, looked like beef not pork. Spareribs , large order, very generous, and they were good. Not the best, but ok. Also an order of shrimp toast was not good at all. ( I didn't try it, but was told - leftovers had to be thrown out ) and my order of roast pork mei fun was huge \u0026 again, ok. Sorry, I won't be back. Very mediocre Chinese take-out, boo :-/And my hunt for yummy take-out in our area continues...."},{"author":"S. C.","rating":5.0,"content":"Makes quick and delicious foods, people here are really nice. I live five miles away from this place, and it's the only Chinese place I go to for years."},{"author":"Bryan L.","rating":5.0,"content":"Good food! Friendly staff, quick and accurate. I've came here for a long time it's great!"}]}{"name":"Sal’s Pizzeria 2.0","business_types":"Italian,Pizza,Seafood","phone":"(631) 569-5100","website":"salspizza2holtsville.com","from_the_business":"","hours":"Mon: 11:00 am - 10:00 pm,Tue: 11:00 am - 10:00 pm,Wed: 11:00 am - 10:00 pm,Thu: 11:00 am - 10:00 pm,Fri: 11:00 am - 10:00 pm,Sat: 11:00 am - 10:00 pm,Sun: 12:00 pm - 9:00 pm","specialties":null,"history":null,"business_owner":null,"meet_the_business_owner":null,"overall_rating":3.5,"takeout":true,"delivery":true,"accepts_credit_cards":true,"accepts_apple_pay":false,"parking":null,"bike_parking":true,"wheelchair_accessible":false,"location":{"address":"1100 11 Waverly Ave","city":"Holtsville","state":"NY","zip":"11742","cross_streets":"","neighborhoods":""},"yelp_website":"http://www.yelp.com/biz/sals-pizzeria-2-0-holtsville","reviews":[{"author":"Erich L.","rating":5.0,"content":"I really liked Papa Francesco's. I actually did not know ownership changed until I called and the girl on the other side said \"Sal's Pizza...\" I had to double check my phone to make sure I dialed the correct #. I actually almost hung up, I was disappointed my favorite pizza place was gone. I'm glad I didn't!!! When I opened the box I was a bit taken back, the pie looked different from Papa Francesco's.  But one bite in I completely forgot about Papa Francesco.  The dough was soft with a good chew, the homemade pizza sauce was delicious, and you can tell they spare no expense on their cheese or pepperoni. The pizza was absolutely fantastic!!! If you're in the Holtsville area and you haven't tried Sal's yet, you need to make your next pizza order here! Like I said before, I really liked Papa Francesco, but now I really LOVE Sal's!!! If you order, make sure you get garlic knots with a side of their homemade sauce (Waverly special - about $18). You will not be disappointed. If you like Joe's, or Little Vincent's, Sal's is better!!!"},{"author":"Peter S.","rating":3.0,"content":"We found this place when we first moved to the neighborhood about 4 years ago.We were hard-pressed to find a slice we didn't like, and I was a big fan of the veggie slices with fried eggplant. We also got to know the owner, Russ, and his sons who were usually around.The slices were good sized (6 to a pie, vs the usual 8), and the crust was nice and this, with a little crispiness to it.This location recently changed hands and became Sal's 2.0. Some of the choices are gone, and the recipes have changed. It's OK, but I'll usually take the ride to Joe's in Holbrook now."},{"author":"Luigi Z.","rating":1.0,"content":"Came in for a quick slice and did not like what I saw or smelled ! The Sicilian pizza bases (no sauce or cheese yet ) were piled up on an open oven door and most of the pizza , including the regular had been what appeared to be sitting for WAY too long. The smell when you walk in was certainly not that of a garlic, basil or an Italian restaurant  but instead the smell of sweat was looming I unfortunately I was a brave soul (and hungry) and decided to get just 1 regular slice , figuring it would be the safest bet. As I thought , it was mediocre at best. They really need to get rid of ALL the clutter , boxes of water, stuff on counters ,etc.. Get some good lighting near the pizza and get rid of the pizza little quicker if it don't sell in few HOURS! Would Not Reccomend!"},{"author":"Nicholas P.","rating":1.0,"content":"Pizza is decent... I ordered a garlic knot crust pie.. \"Be ready in 15\" I show up.. In 15... Pies not even in the oven... I wait patiently and a few minutes later my pizza is done. I get hit with a whopping $20 price tag (to expensive if you ask me) I get home and the garlic knots that are the crust are not even cooked. They're stringy dough knots. Won't be going back there unless it's free."},{"author":"Jerry P.","rating":1.0,"content":"This place is under new ownership but still calls themselves Papa Francescos. The credit card receipt now states the name is Sals. This place is now terrible. Prices have gone up and quality has gone way down. I have been ordering from this place for years, but will never go here again. The last 5 orders ive placed have all been screwed up. Kinda blame myself for tolerating it this long.  STAY AWAY."}]}]